
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/12075599095)



<pre><code>Apply complete! Resources: 4 added, 5 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-master/runs/run-oJi8mm9k75B5o4DP

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=623051e615259cbdddcff0797d5709f4a4b82142]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6]
aws_dynamodb_table.Register: Refreshing state... [id=Register]
aws_s3_bucket.images: Refreshing state... [id=djansang]
aws_api_gateway_rest_api.api: Refreshing state... [id=gozv19c3jf]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=trigger_user_scan]
aws_dynamodb_table.Link_table: Refreshing state... [id=Link_table]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Users: Refreshing state... [id=Users]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=gtenoa]
aws_api_gateway_method.method: Refreshing state... [id=agm-gozv19c3jf-gtenoa-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-gozv19c3jf-gtenoa-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-gozv19c3jf-gtenoa-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-gozv19c3jf-gtenoa-POST]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=trigger_user_scan-lambda]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gozv19c3jf-gtenoa-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=7suq19]
local_file.demo_page: Refreshing state... [id=b676c3d2c852b67560a461826a2c6b34aaf779ab]
local_file.index_page: Refreshing state... [id=c845316bee69b44546aed5f465d68859a00ebc56]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.index_page: Refreshing state... [id=index.html]
aws_s3_bucket_object.demo_page: Refreshing state... [id=demo.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
        id             = "Link_table"
        name           = "Link_table"
      ~ read_capacity  = 0 -> 3
        tags           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
      ~ write_capacity = 0 -> 1
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "user_registration_consulcam"
      ~ layers                         = [
          - "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6",
        ] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "scan_user_consulcam"
      ~ layers                         = [
          - "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6",
        ] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "test_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6" -> (known after apply)
      ~ compatible_runtimes         = [ # forces replacement
          - "python3.7",
            # (1 unchanged element hidden)
        ]
      ~ created_date                = "2024-08-30T14:35:27.663+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "omok6jlQ4kaPJ6wGGcFhL/PRmmolRf+6OVw6mwITX+w=" -> (known after apply)
      ~ source_code_size            = 29433622 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.demo_page will be created
  + resource "aws_s3_bucket_object" "demo_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "demo.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/demo.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 4 to add, 5 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 6 estimated
           $1.872/mo +$0.7488

------------------------------------------------------------------------

aws_lambda_layer_version.test_lambda_layer: Destroying... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6]
aws_dynamodb_table.Link_table: Modifying... [id=Link_table]
aws_s3_bucket.images: Modifying... [id=djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.demo_page: Creating...
local_file.index_page: Creation complete after 0s [id=c845316bee69b44546aed5f465d68859a00ebc56]
local_file.demo_page: Creation complete after 0s [id=b676c3d2c852b67560a461826a2c6b34aaf779ab]
aws_lambda_layer_version.test_lambda_layer: Destruction complete after 1s
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_dynamodb_table.Link_table: Modifications complete after 2s [id=Link_table]
aws_s3_bucket.images: Modifications complete after 5s [id=djansang]
aws_s3_bucket.website: Modifications complete after 5s [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.demo_page: Creating...
aws_s3_bucket_object.demo_page: Creation complete after 1s [id=demo.html]
aws_lambda_layer_version.test_lambda_layer: Creation complete after 8s [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:11]
aws_lambda_function.lambda: Modifying... [id=user_registration_consulcam]
aws_lambda_function.scan: Modifying... [id=scan_user_consulcam]
aws_lambda_function.scan: Modifications complete after 8s [id=scan_user_consulcam]
aws_lambda_function.lambda: Modifications complete after 8s [id=user_registration_consulcam]

Apply complete! Resources: 4 added, 5 changed, 1 destroyed.

Outputs:

register_table = "Register"
stage_url = "https://gozv19c3jf.execute-api.eu-central-1.amazonaws.com/dev"
website_url = "http://mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":195,"Program":"tfcmt","SHA1":"4715e82003b1b679d9792b53188ffd16dd8a9030","Vars":{},"WorkflowName":"Deploy cases"} -->